:PROPERTIES:
:ID:       f608b65b-0ab7-4978-9385-0da0c8fa2d19
:END:
#+STARTUP: overview
#+VISIBILITY: folded
#+TITLE: rust
#+filetags: :project:

* Inbox
filter(|&c| matches!(c, 'a'|'i'|'o'|'u'|'e'|'y'))
- [[id:bf2625f2-703a-4646-9299-e6f8213db340][???]] (from tokio tutorial) The link in the info-box above uses the terminology "bounded by 'static" rather than "its type outlives 'static" or "the value is 'static" for T: 'static. These all mean the same thing, and are different from "annotated with 'static" as in &'static T.
- ??
#+begin_src rust
fn main() {
    let a = {
        2 + 2;
        "rast"
    };
    println!("{:?}", a);
}
#+end_src

#+RESULTS:
#+begin_example
warning: unused arithmetic operation that must be used
 --> src/main.rs:3:15
  |
3 |     let a = { 2+2; "rast" };
  |               ^^^
  |
  = note: `#[warn(unused_must_use)]` on by default

warning: 1 warning emitted

warning: unused arithmetic operation that must be used
 --> src/main.rs:3:15
  |
3 |     let a = { 2+2; "rast" };
  |               ^^^
  |
  = note: `#[warn(unused_must_use)]` on by default

warning: 1 warning emitted

"rast"
#+end_example
- [[https://docs.rs/parking_lot/0.11.1/parking_lot/index.html]]
- https://doc.rust-lang.org/stable/std/io/struct.Cursor.html
- https://docs.rs/bytes/1.0.1/bytes/buf/trait.Buf.html
*** mutable reference to immutable variable
#+begin_src rust :exports both
fn main() {
    let x = 5;
    let y = &mut x;
    ,*y = 8;
}
#+end_src

#+RESULTS:
: error[E0596]: cannot borrow `x` as mutable, as it is not declared as mutable

*** immutable reference to mutable variable
#+begin_src rust :exports both
fn main() {
    let mut x = 5;
    let y = &x;
    *y = 8;
}
#+end_src

#+RESULTS:
: error[E0594]: cannot assign to `*y`, which is behind a `&` reference
: |     let y = &x;
: |             -- help: consider changing this to be a mutable reference: `&mut x`
: |     *y = 8;
: |     ^^^^^^ `y` is a `&` reference, so the data it refers to cannot be written

**** another example
#+begin_src rust :exports both
fn main() {
    let mut x = Box::new(42);
                            //     first iteration       | second iteration      | ...
    let mut z = &x;         // 1   lifetime 'a - created
    for i in 0..3 {
        println!("{}", z);  // 2   lifetime 'a - checked,  lifetime 'b - checked
        x = Box::new(i);    // 3   lifetime 'a - deleted,  lifetime 'b - deleted
        z = &x;             // 4   lifetime 'b - created,  lifetime 'c - created
    }
    println!("{}", z);
}
#+end_src

#+RESULTS:
: 42
: 0
: 1
: 2
*** generic lifetimes
#+begin_src rust
struct StrSplit<'s, 'p> {
  delimiter: &'p str,
  document: &'s str,
}

impl<'s, 'p> Iterator for StrSplit<'s, 'p> {
  type Item = &'s str;
  fn next(&mut self) -> Option<Self::Item> {
    self.document.split(self.delimiter).next()
}}

fn main() {
    let mut a = "ast,ars";
    let d = ",";
    let mut x = StrSplit{delimiter: &d, document:&a};
    a = "ff,ff";
    for i in x.next() {println!("{}", i);}
    println!("{}", a);
}
#+end_src

#+RESULTS:
: ast
: ff,ff
**** COMMENT examples
#+begin_src jupyter-rust :session assoc1 :exports both
trait AssociatedType { type Assoc; type Aff; }
struct Struct;
#[derive(Debug)]
struct OtherStruct;
impl AssociatedType for Struct { type Assoc = OtherStruct; type Aff = String; }
impl OtherStruct {
    fn new() -> OtherStruct { OtherStruct }
}
println!("{:?}\n{:?}",
         <Struct as AssociatedType>::Assoc::new(),
         <Struct as AssociatedType>::Aff::new());
#+end_src

#+RESULTS:
: OtherStruct
: ""

***** COMMENT zero-sized types code example
:PROPERTIES:
:ID:       907a6bf6-cb91-49f2-bb80-8ee003b2317f
:END:
Consider, for instance, a type called Rocket that represents the state of a real rocket. Some operations (methods) on Rocket should be available no matter what state the rocket is in, but some make sense only in particular situations. It is, for example, impossible to launch a rocket if it has already been launched. Similarly, it should probably not be possible to separate the fuel tank if the rocket has not yet launched. We could model these as enum variants, but then all the methods would be available at every stage, and we’d need to introduce possible panics.
#+begin_src jupyter-rust :session xrf
#[derive(Debug)]
struct Grounded;
#[derive(Debug)]
struct Launched;
#[derive(Debug)]
struct Rocket<Stage = Grounded> {
  stage: std::marker::PhantomData<Stage>,
}

impl Default for Rocket<Grounded> { fn default() -> Self { todo!() }}
impl Rocket<Grounded> {
  pub fn launch(self) -> Rocket<Launched> { Rocket { stage: std::marker::PhantomData::<Launched>} }
}
impl Rocket<Launched> {
  pub fn accelerate(&mut self) { println!("accelerating"); }
  pub fn decelerate(&mut self) { }
}

impl<Stage> Rocket<Stage> {
  pub fn color(&self) -> String { String::new() }
  pub fn weight(&self) -> String { String::new() }
}
let mut r = Rocket {stage: std::marker::PhantomData::<Grounded>};
let mut rl = r.launch();
// rl.launch()
// : struct Rocket<Stage = Grounded> {
// : ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ method `launch` not found for this
// : rr.launch()
// :    ^^^^^^ method not found in `Rocket<Launched>`
// : no method named `launch` found for struct `Rocket<Launched>` in the current scope
rl.accelerate()
#+end_src

#+RESULTS:
:RESULTS:
: accelerating

:END:

***** COMMENT example
#+begin_src jupyter-rust :session xxxi
#[derive(Debug)]
enum S<'a> {
    Nope,
    Yup(&'a str)
}
fn pokayoke(v: S) {
    println!("works: {:?}", v);
}
pokayoke(S::Nope);
pokayoke(S::Yup("hello"));
#+end_src

#+RESULTS:
: works: Nope
: works: Yup("hello")

** tokio
- The =#[tokio::main]= function is a macro. It transforms the =async fn main()= into a synchronous =fn main()= that initializes a runtime instance and executes the async main function.For example, the following:
#+begin_src rust
#[tokio::main]
async fn main() {
    println!("hello");
}
#+end_src
gets transformed into:
#+begin_src rust
fn main() {
    let mut rt = tokio::runtime::Runtime::new().unwrap();
    rt.block_on(async {
        println!("hello");
    })
}
#+end_src

#+BEGIN_SRC rust :crates '((tokio . 1.5)) :features '((tokio . ("rt-multi-thread" "time" "macros")))
async fn say_world() {
    println!("world");
}

#[tokio::main]
async fn main() {
    // Calling `say_world()` does not execute the body of `say_world()`.
    let op = say_world();

    // This println! comes first
    println!("hello");

    // Calling `.await` on `op` starts executing `say_world`.
    op.await;
}
#+end_src

#+RESULTS:
: hello
: world
#+begin_quote
- use =tokio::join!= to run multiple futures concurrently. It will wait for all of the futures to complete and return the result of each in a tuple.
- With =spawn_blocking=, you can get the Tokio runtime to run blocking code inside a dedicated thread pool, allowing other futures to continue making progress.
#+end_quote

#+BEGIN_SRC rust :crates '((tokio . 1.5)) :features '((tokio . ("rt-multi-thread" "time" "macros")))
use std::time::Duration;
use tokio::time::sleep;

#[tokio::main]
async fn main() {
    let (v1, v2, v3, v4, v5) = tokio::join!(
        async {
            sleep(Duration::from_millis(1500)).await;
            println!("Value 1 ready");
            "Value 1"
        },
        async {
            sleep(Duration::from_millis(2800)).await;
            println!("Value 2 ready");
            "Value 2"
        },
        async {
            sleep(Duration::from_millis(600)).await;
            println!("Value 3 ready");
            "Value 3"
        },
        async {
            std::thread::sleep(Duration::from_millis(1800));
            println!("Value 4 ready");
            "Value 4"
        },
        async {
            tokio::task::spawn_blocking(|| {
                std::thread::sleep(Duration::from_millis(1800));
            })
            .await
            .unwrap();
            println!("Value 5 ready");
            "Value 5"
        },
    );

    assert_eq!(v1, "Value 1");
    assert_eq!(v2, "Value 2");
    assert_eq!(v3, "Value 3");
    assert_eq!(v4, "Value 4");
    assert_eq!(v5, "Value 5");
}
#+end_src

#+RESULTS:
: Value 4 ready
: Value 1 ready
: Value 3 ready
: Value 2 ready
: Value 5 ready

- =tokio::net::TcpListener= accept inbound TCP sockets
- A Tokio task is an asynchronous green thread, and are created with =tokio::spawn=.
- Tasks are the unit of execution managed by the scheduler.
- =tokio::spawn= function returns a =JoinHandle=
- =await= on =JoinHandle= returns a =Result= (or =Err= if task panics or forcefully cancelled by the runtime shuttind down)
#+BEGIN_SRC rust :crates '((tokio . 1.5)) :features '((tokio . ("rt-multi-thread" "time" "macros")))
#[tokio::main]
async fn main() {
    let handle = tokio::spawn(async {
        "return value"
    });

    println!("{:?}", handle);
    let out = handle.await.unwrap();
    println!("GOT {}", out);
}
#+end_src
- When you spawn a task on the Tokio runtime, its type must be 'static. This means that the spawned task must not contain any references to data owned outside the task. e.g. this will throw error
#+BEGIN_SRC rust :crates '((tokio . 1.5)) :features '((tokio . ("rt-multi-thread" "time" "macros")))
use tokio::task;

#[tokio::main]
async fn main() {
    let v = vec![1, 2, 3];

    task::spawn(async {
        println!("Here's a vec: {:?}", v);
    });
}
#+end_src
but, moving v will fix it
#+BEGIN_SRC rust :crates '((tokio . 1.5)) :features '((tokio . ("rt-multi-thread" "time" "macros")))
use tokio::task;

#[tokio::main]
async fn main() {
    let v = vec![1, 2, 3];

    task::spawn(async move {
        println!("Here's a vec: {:?}", v);
    });
}
#+end_src

#+RESULTS:
: Here's a vec: [1, 2, 3]
- Tasks spawned by tokio::spawn must implement Send (to move task betweet threads while suspended at an .await). Tasks are Send when all data that is held across .await calls is Send. e.g. this works
#+BEGIN_SRC rust :crates '((tokio . 1.5)) :features '((tokio . ("rt-multi-thread" "time" "macros")))
use tokio::task::yield_now;
use std::rc::Rc;

#[tokio::main]
async fn main() {
    tokio::spawn(async {
        // The scope forces `rc` to drop before `.await`.
        {
            let rc = Rc::new("hello");
            println!("{}", rc);
        }

        // `rc` is no longer used. It is **not** persisted when
        // the task yields to the scheduler
        yield_now().await;
    });
}
#+end_src
This does not:
#+BEGIN_SRC rust :crates '((tokio . 1.5)) :features '((tokio . ("rt-multi-thread" "time" "macros")))
use tokio::task::yield_now;
use std::rc::Rc;

#[tokio::main]
async fn main() {
    tokio::spawn(async {
        let rc = Rc::new("hello");

        // `rc` is used after `.await`. It must be persisted to
        // the task's state.
        yield_now().await;

        println!("{}", rc);
    });
}
#+end_src
- tokio::sync::Mutex is a mutex that is locked across calls to .await.
- By default, the Tokio runtime uses a multi-threaded scheduler
- Tokio's channel primitives
  - mpsc: multi-producer, single-consumer channel. Many values can be sent.
  - oneshot: single-producer, single consumer channel. A single value can be sent.
  - broadcast: multi-producer, multi-consumer. Many values can be sent. Each receiver sees every value.
  - watch: single-producer, multi-consumer. Many values can be sent, but no history is kept. Receivers only see the most recent value.
  - multi-producer multi-consumer channel where only one consumer sees each message, you can use the async-channel crate

#+BEGIN_SRC rust :crates '((tokio . 1.5)) :features '((tokio . ("full")))
use tokio::sync::mpsc;

#[tokio::main]
async fn main() {
    let (tx, mut rx) = mpsc::channel(32);
    let tx2 = tx.clone();

    tokio::spawn(async move {
        tx.send("sending from first handle").await;
    });

    tokio::spawn(async move {
        tx2.send("sending from second handle").await;
    });

    while let Some(message) = rx.recv().await {
        println!("GOT = {}", message);
    }
}
#+end_src

#+RESULTS:
#+begin_example
warning: unused `std::result::Result` that must be used
  --> src/main.rs:11:9
   |
11 |         tx.send("sending from first handle").await;
   |         ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
   |
   = note: `#[warn(unused_must_use)]` on by default
   = note: this `Result` may be an `Err` variant, which should be handled

warning: unused `std::result::Result` that must be used
  --> src/main.rs:15:9
   |
15 |         tx2.send("sending from second handle").await;
   |         ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
   |
   = note: this `Result` may be an `Err` variant, which should be handled

warning: 2 warnings emitted

warning: unused `std::result::Result` that must be used
  --> src/main.rs:11:9
   |
11 |         tx.send("sending from first handle").await;
   |         ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
   |
   = note: `#[warn(unused_must_use)]` on by default
   = note: this `Result` may be an `Err` variant, which should be handled

warning: unused `std::result::Result` that must be used
  --> src/main.rs:15:9
   |
15 |         tx2.send("sending from second handle").await;
   |         ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
   |
   = note: this `Result` may be an `Err` variant, which should be handled

warning: 2 warnings emitted

GOT = sending from second handle
GOT = sending from first handle
#+end_example
**** reading from file
#+begin_src shell
echo "arst\narst" >> /tmp/testfile.txt
#+end_src

#+RESULTS:
#+BEGIN_SRC rust :crates '((tokio . 1.5)) :features '((tokio . ("full")))
use tokio::fs::File;
use tokio::io::{self, AsyncReadExt};

#[tokio::main]
async fn main() -> io::Result<()> {
    let mut f = File::open("/tmp/testfile.txt").await?;
    let mut buffer = [0; 8];

    // read up to 10 bytes
    let n = f.read(&mut buffer[..]).await?;

    println!("The bytes: {:?}", &buffer[..n]);

    let mut buffer = Vec::new();
    f.read_to_end(&mut buffer).await?;
    println!("The bytes: {:?}", buffer   );

    Ok(())
}
#+end_src

#+RESULTS:
: The bytes: [97, 114, 115, 116, 92, 110, 97, 114]
: The bytes: [115, 116, 10]
**** writing to file
#+BEGIN_SRC rust :crates '((tokio . 1.5)) :features '((tokio . ("full")))
use tokio::io::{self, AsyncWriteExt};
use tokio::fs::File;

#[tokio::main]
async fn main() -> io::Result<()> {
    let mut file = File::create("/tmp/foo.txt").await?;

    // Writes some prefix of the byte string, but not necessarily all of it.
    let n = file.write(b"some bytes").await?;

    println!("Wrote the first {} bytes of 'some bytes'.", n);

    file.write_all(b"some bytes").await?;

    Ok(())
}
#+end_src

#+RESULTS:
: Wrote the first 10 bytes of 'some bytes'.
#+begin_src shell
cat /tmp/foo.txt
#+end_src

#+RESULTS:
: some bytessome bytes
** TODO [#A] auto-dereferencing rules
https://stackoverflow.com/a/28552082/6086311
#+begin_src rust
struct X { val: i32 }
struct Y { val: i32 }
struct Z { val: Y }
#[derive(Clone, Copy)]
struct A;

impl std::ops::Deref for X {
    type Target = i32;
    fn deref(&self) -> &i32 { &self.val }
}

impl std::ops::Deref for Y {
    type Target = i32;
    fn deref(&self) -> &i32 { &self.val }
}

impl std::ops::Deref for Z {
    type Target = Y;
    fn deref(&self) -> &Y { &self.val }
}

trait M { fn m(self); }
trait RefM { fn refm(&self); }

impl M for i32   { fn m(self) { println!("i32::m()");  } }
impl M for X     { fn m(self) { println!("X::m()");    } }
impl M for &X    { fn m(self) { println!("&X::m()");   } }
impl M for &&X   { fn m(self) { println!("&&X::m()");  } }
impl M for &&&X  { fn m(self) { println!("&&&X::m()"); } }

impl RefM for i32  { fn refm(&self) { println!("i32::refm()");  } }
impl RefM for X    { fn refm(&self) { println!("X::refm()");    } }
impl RefM for &X   { fn refm(&self) { println!("&X::refm()");   } }
impl RefM for &&X  { fn refm(&self) { println!("&&X::refm()");  } }
impl RefM for &&&X { fn refm(&self) { println!("&&&X::refm()"); } }

impl M for    A { fn m(self) { println!("A::m()");    } }
impl M for &&&A { fn m(self) { println!("&&&A::m()"); } }

impl RefM for    A { fn refm(&self) { println!("A::refm()");    } }
impl RefM for &&&A { fn refm(&self) { println!("&&&A::refm()"); } }


fn main() {
    // I'll use @ to denote left side of the dot operator
    (*X{val:42}).m();        // i32::m()    , Self == @
    X{val:42}.m();           // X::m()      , Self == @
    (&X{val:42}).m();        // &X::m()     , Self == @
    (&&X{val:42}).m();       // &&X::m()    , Self == @
    (&&&X{val:42}).m();      // &&&X:m()    , Self == @
    (&&&&X{val:42}).m();     // &&&X::m()   , Self == *@
    (&&&&&X{val:42}).m();    // &&&X::m()   , Self == **@
    println!("-------------------------");

    (*X{val:42}).refm();     // i32::refm() , Self == @
    X{val:42}.refm();        // X::refm()   , Self == @
    (&X{val:42}).refm();     // X::refm()   , Self == *@
    (&&X{val:42}).refm();    // &X::refm()  , Self == *@
    (&&&X{val:42}).refm();   // &&X::refm() , Self == *@
    (&&&&X{val:42}).refm();  // &&&X::refm(), Self == *@
    (&&&&&X{val:42}).refm(); // &&&X::refm(), Self == **@
    println!("-------------------------");

    Y{val:42}.refm();        // i32::refm() , Self == *@
    Z{val:Y{val:42}}.refm(); // i32::refm() , Self == **@
    println!("-------------------------");

    A.m();                   // A::m()      , Self == @
    // without the Copy trait, (&A).m() would be a compilation error:
    // cannot move out of borrowed content
    (&A).m();                // A::m()      , Self == *@
    (&&A).m();               // &&&A::m()   , Self == &@
    (&&&A).m();              // &&&A::m()   , Self == @
    A.refm();                // A::refm()   , Self == @
    (&A).refm();             // A::refm()   , Self == *@
    (&&A).refm();            // A::refm()   , Self == **@
    (&&&A).refm();           // &&&A::refm(), Self == @
}

#+end_src

#+RESULTS:
#+begin_example
i32::m()
X::m()
&X::m()
&&X::m()
&&&X::m()
&&&X::m()
&&&X::m()
-------------------------
i32::refm()
X::refm()
X::refm()
&X::refm()
&&X::refm()
&&&X::refm()
&&&X::refm()
-------------------------
i32::refm()
i32::refm()
-------------------------
A::m()
A::m()
&&&A::m()
&&&A::m()
A::refm()
A::refm()
A::refm()
&&&A::refm()
#+end_example
** destructuring tuple structs/variants with an infallible single-armed match
- https://github.com/rust-lang/rust-clippy/pull/2684
#+begin_src rust
enum Wrapper {
    Data(i32),
}
fn main() {
    let wrapper = Wrapper::Data(42);
    let Wrapper::Data(data) = wrapper;
    println!("{:?}", data)
}
#+end_src

#+RESULTS:
: 42


